tap "oven-sh/bun"

brew "git"

brew "asciinema"
brew "bash-completion@2"
brew "bash"
brew "buf"
brew "carapace"
brew "chafa"
brew "coreutils"
brew "curl"
brew "delve"
brew "dotnet"
brew "fd"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gh"
brew "glow"
brew "gnupg"
brew "go"
brew "goimports"
brew "golang-migrate"
brew "grep"
brew "helix"
brew "htop"
brew "jq"
brew "lazygit"
brew "moreutils"
brew "nx"
brew "oven-sh/bun/bun"
brew "pandoc"
brew "pgformatter"
brew "postgresql"
brew "pygments"
brew "python"
brew "ripgrep"
brew "sc-im"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "stern"
brew "tmux"
brew "tree"
brew "wget"
brew "yazi"
brew "yq"

# language servers
brew "gopls"
brew "harper"
brew "marksman"
brew "postgres-language-server"
brew "tailwindcss-language-server"
brew "taplo"
brew "typescript-language-server"
brew "vscode-langservers-extracted"
brew "yaml-language-server"

# formatters & linters
brew "golangci-lint"
brew "prettier"

# work
brew "asdf"
brew "protoc-gen-go-grpc"
brew "protoc-gen-go"
brew "protoc-gen-js"
brew "tailscale"

if OS.mac?
  tap "nikitabobko/tap"

  # casks
  cask "1password-cli"
  cask "1password"
  cask "aerospace"
  cask "codex"
  cask "dbeaver-community"
  cask "ghostty"
  cask "github"
  cask "google-chrome"
  cask "mysql-shell"
  cask "postman"
  cask "slack"
  cask "temurin"
end
